-- MySQL dump 10.13  Distrib 8.0.21, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: farm
-- ------------------------------------------------------
-- Server version	8.0.21

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `order`
--

DROP TABLE IF EXISTS `order`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `order` (
  `id` int NOT NULL AUTO_INCREMENT,
  `memberId` int NOT NULL,
  `destination` varchar(500) NOT NULL,
  `regDate` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `OrderMemberId` (`memberId`),
  CONSTRAINT `OrderMemberId` FOREIGN KEY (`memberId`) REFERENCES `member` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=57 DEFAULT CHARSET=utf8 COMMENT='주문';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order`
--

LOCK TABLES `order` WRITE;
/*!40000 ALTER TABLE `order` DISABLE KEYS */;
INSERT INTO `order` VALUES (1,1,'서울시 구로구 오류1동 21-1','2020-07-22 05:34:04'),(2,2,'부산','2020-07-22 05:34:04'),(3,4,'서울','2020-07-22 05:34:04'),(4,2,'부산','2020-07-22 05:34:04'),(5,3,'서울 거기','2020-07-30 14:10:51'),(11,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-02 20:13:01'),(12,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-02 20:13:38'),(13,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-02 20:24:36'),(14,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-02 20:30:34'),(15,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-02 20:34:07'),(16,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-02 20:34:08'),(17,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-02 20:44:34'),(18,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 10:24:48'),(19,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 10:24:50'),(20,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 10:31:13'),(21,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 10:31:47'),(22,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 10:32:08'),(23,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 11:22:15'),(24,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 11:22:30'),(25,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 11:22:55'),(26,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 11:42:55'),(27,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 11:47:48'),(28,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 12:01:12'),(29,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 12:04:46'),(30,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 12:06:06'),(31,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 12:20:41'),(32,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 12:21:40'),(33,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 12:24:15'),(34,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 12:26:41'),(35,4,'03154/서울 종로구 종로 1/상세주소/(종로1가)','2020-08-03 12:26:59'),(36,4,'01128/서울 강북구 미아동 160-2/상세주소/(미아동)','2020-08-03 17:12:42'),(37,4,'06774/서울 서초구 강남대로 27/상세주소/ (양재동)','2020-08-03 18:38:26'),(38,4,'06774/서울 서초구 강남대로 27/상세주소/ (양재동)','2020-08-04 09:53:47'),(39,4,'06774/서울 서초구 강남대로 27/상세주소/ (양재동)','2020-08-04 10:06:47'),(40,36,'06649/서울 서초구 반포대로24길 42-12/102호/ (서초동)','2020-08-04 12:03:28'),(41,35,'01107/서울 강북구 솔매로7길 3/ㄹㄹ/ (미아동)','2020-08-04 12:17:47'),(42,32,'03154/서울 종로구 종로 1/상세주소/ (종로1가)','2020-08-04 12:38:09'),(43,35,'01107/서울 강북구 솔매로7길 3/ㄹㄹ/ (미아동)','2020-08-04 13:08:22'),(44,35,'01107/서울 강북구 솔매로7길 3/00/ (미아동)','2020-08-04 14:43:27'),(45,35,'01107/서울 강북구 솔매로7길 3/00/ (미아동)','2020-08-04 15:22:45'),(46,36,'06649/서울 서초구 반포대로24길 42-12/102호/ (서초동)','2020-08-04 16:08:28'),(47,36,'06649/서울 서초구 반포대로24길 42-12/102호/ (서초동)','2020-08-04 16:11:10'),(48,36,'06649/서울 서초구 반포대로24길 42-12/102호/ (서초동)','2020-08-04 16:11:37'),(49,35,'01107/서울 강북구 솔매로7길 3/001/ (미아동)','2020-08-04 17:11:45'),(50,38,'08253/서울 구로구 고척로 49// (오류동, 동부골든아파트)','2020-08-09 01:05:41'),(51,38,'08253/서울 구로구 고척로 49// (오류동, 동부골든아파트)','2020-08-09 17:23:56'),(52,38,'08253/서울 구로구 고척로 49// (오류동, 동부골든아파트)','2020-08-09 17:24:10'),(53,35,'01107/서울 강북구 솔매로7길 3/003/ (미아동)','2020-08-19 10:41:23'),(54,35,'01107/서울 강북구 솔매로7길 3/003/ (미아동)','2020-08-19 10:48:12'),(55,35,'01107/서울 강북구 솔매로7길 3/003/ (미아동)','2020-08-19 11:56:54'),(56,38,'08253/서울 구로구 고척로 49// (오류동, 동부골든아파트)','2020-09-23 09:13:15');
/*!40000 ALTER TABLE `order` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-09-23 16:22:02
