-- MySQL dump 10.13  Distrib 8.0.21, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: farm
-- ------------------------------------------------------
-- Server version	8.0.21

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `item`
--

DROP TABLE IF EXISTS `item`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `item` (
  `id` int NOT NULL AUTO_INCREMENT,
  `sellerId` int NOT NULL,
  `categoryId` int NOT NULL,
  `originId` int NOT NULL,
  `name` varchar(100) NOT NULL,
  `regName` varchar(100) NOT NULL,
  `detail` varchar(20000) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `price` int NOT NULL,
  `regDate` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `startDate` datetime NOT NULL,
  `endDate` datetime NOT NULL,
  `leadTime` int DEFAULT NULL COMMENT '출고소요기간',
  `image` varchar(100) NOT NULL,
  `tag` varchar(100) DEFAULT NULL,
  `pub` int NOT NULL DEFAULT '0',
  `isdel` int NOT NULL DEFAULT '0',
  `deliveryFee` int NOT NULL,
  PRIMARY KEY (`id`,`isdel`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `ItemSellerID_idx` (`sellerId`),
  KEY `ItemCategoryId_idx` (`categoryId`),
  KEY `ItemOriginId_idx` (`originId`),
  CONSTRAINT `ItemCategoryId` FOREIGN KEY (`categoryId`) REFERENCES `category` (`id`),
  CONSTRAINT `ItemOriginId` FOREIGN KEY (`originId`) REFERENCES `origin` (`id`),
  CONSTRAINT `ItemSellerId` FOREIGN KEY (`sellerId`) REFERENCES `member` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=76 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `item`
--

LOCK TABLES `item` WRITE;
/*!40000 ALTER TABLE `item` DISABLE KEYS */;
INSERT INTO `item` VALUES (1,1,18,20,'당도 높은 배','배','꿀 맛 배, 여기서 사면 꿀맛 보장',10000,'2020-07-18 00:00:00','2020-07-19 00:00:00','2020-07-25 00:00:00',3,'pear2.jpg','배/꿀맛',1,0,2500),(2,1,7,29,'성일이가 좋아하는 쌀','SSS2','온가족 건강 지킴이 미네랄 쌀',10000,'2020-07-19 22:41:56','2020-07-20 00:00:00','2020-08-20 00:00:00',6,'rice.jpg','밥/경기',1,0,2500),(3,1,9,29,'다리사과','APL1','딸기포도배',5000,'2020-07-19 22:43:11','2020-07-20 00:00:00','2020-08-20 00:00:00',5,'apple.jpg','경기/사과',1,0,2500),(6,4,18,29,'달고 시원한 배 ','달고 시원한 배','달고 시원한 배입니다',5000,'2020-07-30 15:08:20','2020-07-30 00:00:00','2020-08-21 00:00:00',9,'pear.jpg','배/시원한',1,0,2500),(8,4,18,29,'배','PE1','당도 높은 배',3500,'2020-07-31 15:30:39','2020-07-31 00:00:00','2020-08-21 00:00:00',7,'pear2.jpg','배',1,0,2500),(10,4,16,29,'당근주스','KJ1','당근100%',2500,'2020-07-21 15:33:17','2020-07-21 00:00:00','2020-09-01 00:00:00',4,'carrotJuice.png','당근/당근주스',1,0,2500),(11,4,12,60,'알이 굵은 감자','감자','감자, 다이어트에도 좋고 몸에도 좋은 알이 굵은 감자',20000,'2020-07-21 15:34:47','2020-07-21 00:00:00','2020-09-01 00:00:00',3,'potato.jpg','감자',1,0,2500),(12,4,7,29,'발효 발아 흑미','흑미','발효 발아 흑미는 기능성이 있는 미생물을 쌀 표면에 배양하거나 발효시키는 방법으로 생산한 쌀입니다.',14000,'2020-07-21 15:36:13','2020-07-31 00:00:00','2099-01-01 00:00:00',1,'blackrice.png','밥/햇반/흑미',1,0,2500),(13,1,7,29,'발아 현미','sss4','현미 상태의 쌀을 발아가정을 통해 현미에 비해 식감이 부드럽고 다양한 영양분을 가지고 있습니다.',5000,'2020-08-04 15:37:03','2020-07-21 00:00:00','2020-09-01 00:00:00',10,'mixrice.jpg','밥/쌀',1,0,2500),(14,1,9,64,'빨간 사과','사과','색을 보면, 맛을 알죠!',7000,'2020-07-21 15:39:35','2020-07-21 00:00:00','2020-08-25 00:00:00',3,'apple.jpg','사과',1,0,2500),(15,1,16,20,'건강한 당근주스','당근주스','건강을 생각하고, 올바른 식생활을 원한다면 당근주스',7000,'2020-07-21 15:40:39','2020-07-21 00:00:00','2020-08-29 00:00:00',3,'carrotJuice.png','당근주스/건강식',1,0,2500),(18,4,8,29,'울산 배','job1','천연 영양제로 키운 당도 높은 배 농수산물우수관리 인증도 받아',2000,'2020-07-21 15:45:06','2020-07-21 00:00:00','2020-08-21 00:00:00',5,'pear2.jpg','쌀',1,0,2500),(19,4,7,29,'건강 쌀','goa1','쌀 중심의 식단은 쉽게 포만감을 주고 채소류로 된 반찬을 같이 섭취하며 영양적으로도 우수합니다.',2000,'2020-07-21 15:45:16','2020-07-21 00:00:00','2020-08-21 00:00:00',5,'rice.jpg','쌀',1,0,2500),(20,4,7,29,'웰빙 쌀','goa3','쌀에 포함된 전분 대부분이 저항전분으로 비만 뿐 아니라 고혈압, 당뇨병에도 효과적입니다.',20000,'2020-07-21 15:45:16','2020-07-21 01:00:00','2020-08-21 00:00:00',5,'rice.jpg','쌀',1,0,2500),(21,4,10,20,'속이 꽉찬 배추','배추','오늘 김장? 그럼 이거 강츄!',10000,'2020-07-21 15:45:17','2020-07-21 00:00:08','2020-08-21 00:00:00',2,'cabbage2.jpg','배추/김장',1,0,2500),(22,4,7,29,'키 크는 쌀','goa4','성장기 어린이 에게는 미네랄과 다양한 단백질의 공급이 키가 크고 근육이 발달하는데 결정적인 기여를 합니다.',15000,'2020-07-21 15:45:17','2020-07-21 00:00:07','2020-08-21 00:00:00',5,'rice.jpg','쌀',1,0,2500),(23,4,7,29,'건강한 쌀','moa543','환자, 노약자 ,수험생의 경우 빠른 회박과 활발한 두뇌활동을 위하여 필수 아미노산의 섭취가 필요합니다.',2000,'2020-07-21 15:45:17','2020-07-21 00:00:05','2020-08-21 00:00:00',5,'rice.jpg','쌀',1,0,2500),(24,4,7,29,'머리 좋아지는 쌀','goa3','라이신은 연골과 인대 등의 조작형성에 필요하며 필요한 아미노산이 풍부합니다.',25000,'2020-07-21 15:45:21','2020-07-21 00:00:04','2020-08-21 00:00:00',5,'rice.jpg','쌀',1,0,2500),(25,4,7,29,'보리보리 쌀','sss','네그렇습니다. 바로 보리보리쌀입니다 보리랑 쌀을 섞어 건강이 두배입니다.',15000,'2020-07-21 15:45:21','2020-07-21 00:00:03','2020-08-21 00:00:00',5,'rice.jpg','쌀',1,0,2500),(26,4,18,85,'가슴으로 낳은 배','배','정성을 들여 키우고 수확한 배',20000,'2020-07-21 15:45:21','2020-07-21 00:00:02','2020-08-21 00:00:00',2,'pear.jpg','배',1,0,2500),(27,4,14,60,'정성을 담은 꿀','꿀','이것이 레알 꿀',20000,'2020-07-21 15:45:22','2020-07-21 00:00:01','2020-08-21 00:00:00',3,'honey2.jpg','꿀',1,0,2500),(28,4,7,29,'흑색미','sss1','흑미는 천연 황산화물질로 피부노화를 방지하고 위암과 대장암 세포의 증식을 억제하는 기능을 하는 것으로 알려진 물질 함량이 높아 노화지연, 피부미용, 면역력 증진, 변비 개선들에 효과적입니다.',2000,'2020-08-04 15:45:22','2020-07-21 00:00:00','2020-08-21 00:00:00',5,'blackrice.png','쌀/흑미',1,0,2500),(29,4,16,16,'당근 주스','당근주스','당근주스는 맛나죠, 사과랑 같이 갈면 더 존맛탱',5000,'2020-07-21 15:45:22','2020-07-21 00:00:00','2020-08-21 00:00:00',5,'carrotJuice2.png','당근주스',1,0,2500),(30,4,19,16,'유기농 아이스크림','아이스크림','유기농 아이스크림',5000,'2020-07-21 15:45:22','2020-07-21 00:00:00','2020-08-21 00:00:00',5,'icecream2.jpg','쌀',1,0,2500),(31,4,7,29,'무','무','내 다리 같은 무, 튼실하죠.',5000,'2020-07-21 15:45:22','2020-07-21 00:00:00','2020-08-21 00:00:00',3,'radish2.jpg','무',1,0,2500),(32,4,10,15,'속이 꽉찬 배추','배추','오늘 김장 하신다면, 이 배추 강츄!',10000,'2020-07-21 15:45:22','2020-07-21 00:00:00','2020-08-21 00:00:00',3,'cabbage.jpg','배추',1,0,2500),(33,4,14,29,'허니허니 꿀꿀','꿀','이것이 레알 꿀 맛',30000,'2020-07-21 15:45:22','2020-07-21 00:00:00','2020-08-21 00:00:00',5,'honey.jpg','꿀/뀰',1,0,2500),(34,4,13,74,'달달한 딸기','딸기','맛도 좋고 몸에 좋은 딸기, 우리 가족 건강식',10000,'2020-07-21 15:45:22','2020-07-21 00:00:00','2020-08-21 00:00:00',2,'strawberry2.jpg','딸기',1,0,2500),(35,4,17,29,'건강 포도즙','포도즙','건강한 포도즙 입니다. ',20000,'2020-07-21 15:45:23','2020-07-21 00:00:00','2020-08-21 00:00:00',3,'grapeJuice.jpg','포도즙',1,0,2500),(36,4,15,13,'케일 주스','케일주스','건강을 생각한다면 케일주스',5000,'2020-07-21 15:45:23','2020-07-21 00:00:00','2020-08-21 00:00:00',5,'KaleJuice2.jpg','케일주스',1,0,2500),(37,4,8,29,'케일 주스','케일 주스','몸에 독소가 빠지는 듯한 맛',10000,'2020-07-30 15:45:23','2020-07-30 00:00:00','2020-08-21 00:00:00',3,'KaleJuice2.jpg','케일주스',1,1,2500),(38,4,8,29,'20곡 잡곡','sss','2000',2000,'2020-07-21 15:45:23','2020-07-21 00:00:00','2020-08-21 00:00:00',5,'rice.jpg','쌀',1,1,2500),(39,4,13,29,'딸기','딸기','꿀맛 딸기',50000,'2020-07-21 15:47:35','2020-07-21 00:00:00','2020-08-21 00:00:00',5,'strawberry2.jpg','딸기',1,0,2500),(40,4,7,29,'백진주','SSSS','삼각김밥용 쌀입니다.',50000,'2020-07-21 15:47:35','2020-07-21 00:00:00','2020-08-21 00:00:00',5,'rice.jpg','쌀',1,0,2500),(44,1,7,29,'당근쥬스 5리터','c1','존맛당근쥬쥬스',10000,'2020-07-24 12:45:10','2020-07-21 00:00:00','2020-08-21 00:00:00',1,'rice.jpg','당근',1,1,2500),(46,1,7,30,'유기농 아이스크림','아스크림','유기농 아이스크림 입니다~',8000,'2020-07-26 18:55:14','2020-07-06 00:00:00','2026-12-26 00:00:00',3,'icecream.jfif','유기농/아이스크림',1,1,10000),(47,1,7,30,'이미지올라가라','어셈블?','사과딸기포도배~~',9999,'2020-07-26 18:57:03','2020-07-26 00:00:00','2020-07-31 00:00:00',NULL,'KakaoTalk_20200710_114821836.jpg','제발요',0,1,29999),(48,1,7,30,'제발요','부탁해요','사과딸기포도배~~',222222,'2020-07-26 19:06:58','2020-07-08 00:00:00','2020-07-31 00:00:00',NULL,'KakaoTalk_20200710_114821836.jpg','제발요',0,1,222222),(49,1,7,30,'asdf','adsf','사과딸기포도배~~',2222,'2020-07-26 19:08:51','2020-07-15 00:00:00','2020-07-26 00:00:00',NULL,'11.jpg','2222',0,1,222222),(50,1,7,30,'asdf','adsf','사과딸기포도배~~',2222,'2020-07-26 19:10:00','2020-07-15 00:00:00','2020-07-26 00:00:00',NULL,'11.jpg','2222',0,1,222222),(51,1,7,30,'asdf','asdf','사과딸기포도배~~',222,'2020-07-26 19:11:32','2020-07-26 00:00:00','2020-07-27 00:00:00',NULL,'11.jpg','222222',0,1,2222222),(52,1,7,30,'123','123','사과딸기포도배~~',123,'2020-07-26 19:26:28','2020-07-26 00:00:00','2020-07-27 00:00:00',NULL,'한글.png','1111',0,1,11111),(53,1,7,30,'22222','222222','사과딸기포도배~~',22222,'2020-07-27 13:00:54','2020-07-27 00:00:00','2020-07-28 00:00:00',NULL,'222.bmp','2222222222222222',0,1,222222),(54,1,7,30,'2222','2222','사과딸기포도배~~',222,'2020-07-27 17:25:40','2020-07-27 00:00:00','2020-07-28 00:00:00',NULL,'고양이.jpg','222',0,1,2222),(55,1,7,30,'카테고리확인','서울 서울시','사과딸기포도배~~',222,'2020-07-27 17:26:32','2020-07-27 00:00:00','2020-07-27 00:00:00',NULL,'고양이 - 복사본 (2).jpg','222',0,1,22222),(58,1,7,39,'22','22','사과딸기포도배~~',22,'2020-07-27 17:48:16','2020-07-27 00:00:00','2020-07-27 00:00:00',NULL,'고양이 - 복사본 (5).jpg','2222',0,1,2222),(59,1,7,64,'222','222','사과딸기포도배~~',22,'2020-07-27 17:56:23','2020-07-27 00:00:00','2020-07-28 00:00:00',NULL,'고양이 - 복사본 (2).jpg','2222',0,1,222222),(60,1,7,44,'22','22','사과딸기포도배~~',22,'2020-07-27 18:18:35','2020-07-08 00:00:00','2020-07-14 00:00:00',NULL,'고양이 - 복사본 (4).jpg','222',0,1,2222),(61,1,7,56,'22','22','사과딸기포도배~~',22,'2020-07-27 18:19:18','2020-07-13 00:00:00','2020-07-22 00:00:00',NULL,'고양이 - 복사본.jpg','222',0,1,22222),(62,1,7,56,'22','22','사과딸기포도배~~',22,'2020-07-27 18:20:22','2020-07-13 00:00:00','2020-07-22 00:00:00',NULL,'고양이 - 복사본.jpg','222',0,1,22222),(63,1,7,90,'222','22','사과딸기포도배~~',22,'2020-07-27 18:25:40','2020-07-28 00:00:00','2020-07-28 00:00:00',NULL,'고양이 - 복사본 (6).jpg','222',0,1,2222),(64,1,7,78,'라스트 테스트','라스트테스트','사과딸기포도배~~',222,'2020-07-27 18:29:47','2020-07-27 00:00:00','2020-07-27 00:00:00',NULL,'adsf.bmp','222',0,1,1222),(66,1,7,165,'adsf','asdf','사과딸기포도배~~',2222222,'2020-07-28 13:53:00','2020-07-29 00:00:00','2020-07-29 00:00:00',NULL,'222.bmp','',0,1,22),(70,1,7,164,'adsf','asdf','사과딸기포도배~~',2222,'2020-07-28 13:54:55','2020-07-29 00:00:00','2020-07-29 00:00:00',NULL,'2222.bmp','222',0,1,222222),(71,1,7,88,'dasf','asdf','사과딸기포도배~~',2000,'2020-07-28 13:55:22','2020-07-28 00:00:00','2020-07-28 00:00:00',NULL,'2222.bmp','2222',0,1,232244),(72,1,7,66,'asd','adsf','사과딸기포도배~~',222,'2020-07-28 16:20:30','2020-07-14 00:00:00','2020-07-30 00:00:00',NULL,'2222222.bmp','2222',0,1,2222222),(74,1,8,165,'우리집에서 기른 현미 1kg','test','<p>wqqw</p><p><mark class=\"marker-yellow\">asdsa</mark></p>',12000,'2020-08-01 13:27:12','2020-08-12 15:00:00','2020-08-12 15:00:00',NULL,'sample.jpg','#현미, #홈메이드',0,1,2500),(75,1,12,165,'알감자 ','감자','감자는 이걸로 하는게 굳',10000,'2020-08-01 19:17:58','2020-08-12 15:00:00','2020-08-12 15:00:00',NULL,'potato.jpg','감자',1,0,11);
/*!40000 ALTER TABLE `item` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-09-23 16:22:02
